src/controllers/UserController.php

    public function actionIndex()
    {
        $users = new User();
        return $this->renderAjax('index', ['users' => $users->find()->all()]);
---
SELECT * FROM `user`