src/models/User.php

SELECT * FROM `user` WHERE `id`=1
---
    public static function findIdentity($id)
    {
        $model = new User();
        $user = $model->findOne(['id' => $id ]);

SELECT * FROM `user` WHERE `username`='xx'
---
    public static function findByUsername($username)
    {
        $model = new User();
        $user = $model->findOne(['login' => $username ]);